IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/AM263/CONTROLSS_G0_EPWM17_CONTROLSS_G0_EPWM17.xml
	<register id="CONTROLSS_G0_EPWM17_LUTCTLA" acronym="CONTROLSS_G0_EPWM17_LUTCTLA" offset="0xC20" width="32" description="LUT control register on PWMA">
		<bitfield id="LUTDEC7" width="1" begin="23" end="23" resetval="0x0" description="0 : Force 0 1 : Force 1" range="23" rwaccess="R/W"/> 
		<bitfield id="LUTDEC6" width="1" begin="22" end="22" resetval="0x0" description="0 : Force 0 1 : Force 1" range="22" rwaccess="R/W"/> 
		<bitfield id="LUTDEC5" width="1" begin="21" end="21" resetval="0x0" description="0 : Force 0 1 : Force 1" range="21" rwaccess="R/W"/> 
		<bitfield id="LUTDEC4" width="1" begin="20" end="20" resetval="0x0" description="0 : Force 0 1 : Force 1" range="20" rwaccess="R/W"/> 
		<bitfield id="LUTDEC3" width="1" begin="19" end="19" resetval="0x0" description="0 : Force 0 1 : Force 1" range="19" rwaccess="R/W"/> 
		<bitfield id="LUTDEC2" width="1" begin="18" end="18" resetval="0x0" description="0 : Force 0 1 : Force 1" range="18" rwaccess="R/W"/> 
		<bitfield id="LUTDEC1" width="1" begin="17" end="17" resetval="0x0" description="0 : Force 0 1 : Force 1" range="17" rwaccess="R/W"/> 
		<bitfield id="LUTDEC0" width="1" begin="16" end="16" resetval="0x0" description="0 : Force 0 1 : Force 1" range="16" rwaccess="R/W"/> 
		<bitfield id="SELXBAR" width="4" begin="7" end="4" resetval="0x0" description="Selects one of the 16 outputs of ICSSXBAR to feed into IN3 of LUTA" range="7 - 4" rwaccess="R/W"/> 
		<bitfield id="BYPASS" width="1" begin="0" end="0" resetval="0x1" description="1 : Bypass LUT logic on PWMA 0 : PWMA driven by LUTA" range="0" rwaccess="R/W"/>
	</register>
	<register id="CONTROLSS_G0_EPWM17_LUTCTLB" acronym="CONTROLSS_G0_EPWM17_LUTCTLB" offset="0xC24" width="32" description="LUT control register on PWMB">
		<bitfield id="LUTDEC7" width="1" begin="23" end="23" resetval="0x0" description="0 : Force 0 1 : Force 1" range="23" rwaccess="R/W"/> 
		<bitfield id="LUTDEC6" width="1" begin="22" end="22" resetval="0x0" description="0 : Force 0 1 : Force 1" range="22" rwaccess="R/W"/> 
		<bitfield id="LUTDEC5" width="1" begin="21" end="21" resetval="0x0" description="0 : Force 0 1 : Force 1" range="21" rwaccess="R/W"/> 
		<bitfield id="LUTDEC4" width="1" begin="20" end="20" resetval="0x0" description="0 : Force 0 1 : Force 1" range="20" rwaccess="R/W"/> 
		<bitfield id="LUTDEC3" width="1" begin="19" end="19" resetval="0x0" description="0 : Force 0 1 : Force 1" range="19" rwaccess="R/W"/> 
		<bitfield id="LUTDEC2" width="1" begin="18" end="18" resetval="0x0" description="0 : Force 0 1 : Force 1" range="18" rwaccess="R/W"/> 
		<bitfield id="LUTDEC1" width="1" begin="17" end="17" resetval="0x0" description="0 : Force 0 1 : Force 1" range="17" rwaccess="R/W"/> 
		<bitfield id="LUTDEC0" width="1" begin="16" end="16" resetval="0x0" description="0 : Force 0 1 : Force 1" range="16" rwaccess="R/W"/> 
		<bitfield id="SELXBAR" width="4" begin="7" end="4" resetval="0x0" description="Selects one of the 16 outputs of ICSSXBAR to feed into IN3 of LUTB" range="7 - 4" rwaccess="R/W"/> 
		<bitfield id="BYPASS" width="1" begin="0" end="0" resetval="0x1" description="1 : Bypass LUT logic on PWMB 0 : PWMB driven by LUTB" range="0" rwaccess="R/W"/>
	</register>
</module>